Reports/ДокументыБезОригиналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ДокументыБезОригиналов</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/РазделыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>РазделыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДелаТомаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналПередачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиМнеСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиОтделаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрагентыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторингПроцессовСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращенияГражданСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьмаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭскалацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессыСписок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДокументыБезОригиналов/Ext/ManagerModule.bsl
#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.ДокументыИФайлы));
	
	Если КлючВариантаОтчета = "СписокДокументовБезОригиналов" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВнутренниеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВходящиеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ИсходящиеДокументыСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
